Project/Toir/src/Catalogs/ШаблоныЗаполнения/ШаблоныЗаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЗаполнения</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>ЭлементыШаблона</name>
    <attributes>
      <name>ИспользованиеСУровня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСтроки</name>
      <type>
        <types>EnumRef.ТипыСтрокШаблона</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДляВывода</name>
      <type>
        <types>EnumRef.РеквизитыДляВывода</types>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьФормулуДляШага</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШагСчетчика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаДляШага</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДляПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Enums/РеквизитыДляВывода/РеквизитыДляВывода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РеквизитыДляВывода</name>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Наименование</name>
  </enumValues>
  <enumValues>
    <name>Счетчик</name>
  </enumValues>
  <enumValues>
    <name>Значение</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/ТипыСтрокШаблона/ТипыСтрокШаблона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтрокШаблона</name>
  <enumValues>
    <name>РеквизитРодителя</name>
  </enumValues>
  <enumValues>
    <name>АтрибутРодителя</name>
  </enumValues>
  <enumValues>
    <name>РеквизитОбъекта</name>
  </enumValues>
  <enumValues>
    <name>АтрибутОбъекта</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/ШаблоныЗаполнения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьОбразецКода();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьРежимИспользованияФормулыДляШага()
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьРежимИспользованияФормулыДляШага();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаОшибкаВШаблонеНажатие(Элемент)
	
	Для Каждого СтрокаОшибки ИЗ СписокОшибок Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки.ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЭлементыШаблона

&НаКлиенте
Процедура ЭлементыШаблонаПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ЭлементыШаблона.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ТипРеквизитаСчетчик = ПредопределенноеЗначение("Перечисление.РеквизитыДляВывода.Счетчик");
		
		Элементы.ГруппаШагДляСчетчика.Доступность = (ТекДанные.РеквизитДляВывода = ТипРеквизитаСчетчик);
		Элементы.ЭлементыШаблонаШагСчетчика.Доступность    = НЕ ТекДанные.ИспользоватьФормулуДляШага;
		Элементы.ЭлементыШаблонаФормулаДляШага.Доступность = ТекДанные.ИспользоватьФормулуДляШага;
		
		ТипСтрокиТекст = ПредопределенноеЗначение("Перечисление.ТипыСтрокШаблона.Текст");
		ЗаголовокТекста = ?(ТекДанные.ТипСтроки = ТипСтрокиТекст, НСтр("ru='Текст'"), НСтр("ru='Формула'"));
		Если НЕ Элементы.ЭлементыШаблонаФормат.Заголовок = ЗаголовокТекста Тогда
			Элементы.ЭлементыШаблонаФормат.Заголовок = ЗаголовокТекста;
		КонецЕсли;
		Элементы.ЭлементыШаблонаЗначениеДляПроверки.Доступность = НЕ (ТекДанные.ТипСтроки = ТипСтрокиТекст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаТипСтрокиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭлементыШаблона.ТекущиеДанные;
	
	ТипСтрокиТекст = ПредопределенноеЗначение("Перечисление.ТипыСтрокШаблона.Текст");
	ЗаголовокТекста = ?(ТекДанные.ТипСтроки = ТипСтрокиТекст, НСтр("ru='Текст'"), НСтр("ru='Формула'"));
	Если НЕ Элементы.ЭлементыШаблонаФормат.Заголовок = ЗаголовокТекста Тогда
		Элементы.ЭлементыШаблонаФормат.Заголовок = ЗаголовокТекста;
	КонецЕсли;
	Элементы.ЭлементыШаблонаЗначениеДляПроверки.Доступность = НЕ (ТекДанные.ТипСтроки = ТипСтрокиТекст);
	
	ТипРеквизитаЗначение = ПредопределенноеЗначение("Перечисление.РеквизитыДляВывода.Значение");
	Если НЕ ТекДанные.РеквизитДляВывода = ТипРеквизитаЗначение Тогда
		ТекДанные.РеквизитДляВывода = ТипРеквизитаЗначение;
	КонецЕсли;
	
	СформироватьОбразецКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаУровеньРодителяПриИзменении(Элемент)
	СформироватьОбразецКода();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаРеквизитДляВыводаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭлементыШаблона.ТекущиеДанные;
	Элементы.ГруппаШагДляСчетчика.Доступность = 
		(ТекДанные.РеквизитДляВывода = ПредопределенноеЗначение("Перечисление.РеквизитыДляВывода.Счетчик"));
	СформироватьОбразецКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаФорматПриИзменении(Элемент)
	СформироватьОбразецКода();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаРежимИспользованияФормулыДляШагаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭлементыШаблона.ТекущиеДанные;
	ТекДанные.ИспользоватьФормулуДляШага = (ТекДанные.РежимИспользованияФормулыДляШага = 1);
	
	Элементы.ЭлементыШаблонаШагСчетчика.Доступность    = НЕ ТекДанные.ИспользоватьФормулуДляШага;
	Элементы.ЭлементыШаблонаФормулаДляШага.Доступность = ТекДанные.ИспользоватьФормулуДляШага;
	
	Если ТекДанные.ИспользоватьФормулуДляШага Тогда
		ТекДанные.ШагСчетчика = 0;
	Иначе
		ТекДанные.ФормулаДляШага = "";
	КонецЕсли;
	
	СформироватьОбразецКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаШагСчетчикаПриИзменении(Элемент)
	СформироватьОбразецКода();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаФормулаДляШагаПриИзменении(Элемент)
	СформироватьОбразецКода();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыШаблонаЗначениеДляПроверкиПриИзменении(Элемент)
	СформироватьОбразецКода();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьРежимИспользованияФормулыДляШага()
	
	Для Каждого СтрокаТЧ ИЗ Объект.ЭлементыШаблона Цикл
		СтрокаТЧ.РежимИспользованияФормулыДляШага = ?(СтрокаТЧ.ИспользоватьФормулуДляШага, 1, 0);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОбразецКода()
	
	ОбразецЗначения = "";
	Отказ = Ложь;
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ЭлементыШаблона Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипСтроки) Тогда
			Отказ = Истина;
			ТекстОшибки = УправлениеНСИФункцииКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(
				НСтр("ru='В строке %1 не указан тип элемента шаблона.'"), СтрокаТЧ.НомерСтроки);
			МассивОшибок.Добавить(ТекстОшибки);
		ИначеЕсли СтрокаТЧ.ТипСтроки = ПредопределенноеЗначение("Перечисление.ТипыСтрокШаблона.Текст") Тогда
			ОбразецЗначения = ОбразецЗначения + СтрокаТЧ.Формат;
		Иначе
			ОбразецЗначения = ОбразецЗначения + ?(ЗначениеЗаполнено(СтрокаТЧ.Формат), 
				ШаблоныСтрокКлиентСервер.ФорматироватьСтроку(
					СтрокаТЧ.ЗначениеДляПроверки, СтрокаТЧ.Формат, Отказ, МассивОшибок), СтрокаТЧ.ЗначениеДляПроверки);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.КартинкаОшибкаВШаблоне.Видимость = Отказ;
	Элементы.ОбразецЗначения.ЦветФона = ?(Отказ, WebЦвета.ЛососьСветлый, WebЦвета.БледноЗеленый);
	СписокОшибок.Очистить();
	Если Отказ Тогда 
		Для Каждого ТекстСообщения ИЗ МассивОшибок Цикл
			СтрокаОшибки = СписокОшибок.Добавить();
			СтрокаОшибки.ТекстОшибки = ТекстСообщения;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
